create_clock -period 20.000 -name VIRTUAL_SYSCLK_50 -waveform {0.000 10.000}
create_clock -period 2.000 -name VIRTUAL_GCLK_250 -waveform {0.000 2.000}
create_clock -period 1.000 -name VIRTUAL_USERCLK -waveform {0.000 4.000}

create_generated_clock -name CLKLOOP_O -source [get_pins eventbuilder_per_inst/evtbuilderfull_inst/sramfifo_inst/sramcntrl_inst/sramclk_inst/ODDR2_clk/C] -divide_by 1 [get_ports CLKLOOP_O]
create_generated_clock -name MEMCLK -source [get_pins eventbuilder_per_inst/evtbuilderfull_inst/sramfifo_inst/sramcntrl_inst/sramclk_inst/ODDR2_SRAM_CLK/C] -divide_by 1 [get_ports MEMCLK]

set_input_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports {A[*] AM[*] D[*] GA_N[*] SWA[*] AS_N BERR_N DS0_N DS1_N DTACK_N GAP_N IACK_I_N IACK_N}]
set_input_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 0.000 [get_ports {A[*] AM[*] D[*] GA_N[*] SWA[*] AS_N BERR_N DS0_N DS1_N DTACK_N GAP_N IACK_I_N IACK_N}]

set_input_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PMEMD1]
set_input_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 0.000 [get_ports PMEMD1]

set_input_delay -clock [get_clocks VIRTUAL_USERCLK] -min -add_delay 1.100 [get_ports {MEMD[*]}]
set_input_delay -clock [get_clocks VIRTUAL_USERCLK] -max -add_delay 3.300 [get_ports {MEMD[*]}]
set_output_delay -clock [get_clocks VIRTUAL_USERCLK] -min -add_delay -0.100 [get_ports {MEMA[*]}]
set_output_delay -clock [get_clocks VIRTUAL_USERCLK] -max -add_delay 1.500 [get_ports {MEMA[*]}]
set_output_delay -clock [get_clocks VIRTUAL_USERCLK] -min -add_delay -0.100 [get_ports {MEMD[*]}]
set_output_delay -clock [get_clocks VIRTUAL_USERCLK] -max -add_delay 1.500 [get_ports {MEMD[*]}]
set_output_delay -clock [get_clocks VIRTUAL_USERCLK] -min -add_delay -0.100 [get_ports MEMRWB]
set_output_delay -clock [get_clocks VIRTUAL_USERCLK] -max -add_delay 1.500 [get_ports MEMRWB]

set_input_delay -clock [get_clocks VIRTUAL_GCLK_250] -clock_fall -min -add_delay 0.000 [get_ports {FPAIN[*] FPBIN[*] FPCIN[*] FPDIN[*]}]
set_input_delay -clock [get_clocks VIRTUAL_GCLK_250] -clock_fall -max -add_delay 0.000 [get_ports {FPAIN[*] FPBIN[*] FPCIN[*] FPDIN[*]}]
set_input_delay -clock [get_clocks VIRTUAL_GCLK_250] -min -add_delay 0.000 [get_ports {FPAIN[*] FPBIN[*] FPCIN[*] FPDIN[*]}]
set_input_delay -clock [get_clocks VIRTUAL_GCLK_250] -max -add_delay 0.000 [get_ports {FPAIN[*] FPBIN[*] FPCIN[*] FPDIN[*]}]

set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports {FPGAIN[*]}]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports {FPGAIN[*]}]
set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports STATA_IN]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports STATA_IN]
set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports STATB_IN]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports STATB_IN]
set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports SYNCFI]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports SYNCFI]
set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports TOKENFI]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports TOKENFI]
set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports TRIG1F]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports TRIG1F]
set_input_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports TRIG2F]
set_input_delay -clock [get_clocks CLK125F_P] -max -add_delay 0.000 [get_ports TRIG2F]
set_input_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports WRITE_N]
set_input_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 0.000 [get_ports WRITE_N]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports {A[*]}]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports {A[*]}]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports {D[*]}]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports {D[*]}]
set_output_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports {FPGAOUT[*]}]
set_output_delay -clock [get_clocks CLK125F_P] -max -add_delay 4.000 [get_ports {FPGAOUT[*]}]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports {IRQ_N[*]}]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports {IRQ_N[*]}]

set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports A_DIR]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports A_DIR]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports A_LE]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports A_LE]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports BERR_EN]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports BERR_EN]
set_output_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports BUSY_OUT]
set_output_delay -clock [get_clocks CLK125F_P] -max -add_delay 4.000 [get_ports BUSY_OUT]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports DTACK_EN]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports DTACK_EN]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports DTACK_FPGA]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports DTACK_FPGA]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports D_DIR]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports D_DIR]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports D_LE]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports D_LE]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports D_OE_N]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports D_OE_N]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PCLKLOAD]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PCLKLOAD]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PCLKOUT1]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PCLKOUT1]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PCLKOUT2]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PCLKOUT2]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PCLKSIN1]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PCLKSIN1]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PCLKSIN2]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PCLKSIN2]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PCSWCFG]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PCSWCFG]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PMEMCE_N]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PMEMCE_N]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports PMEMD0]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports PMEMD0]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -min -add_delay 0.000 [get_ports RETRY_OE]
set_output_delay -clock [get_clocks VIRTUAL_SYSCLK_50] -max -add_delay 10.000 [get_ports RETRY_OE]
set_output_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports SDLINKF]
set_output_delay -clock [get_clocks CLK125F_P] -max -add_delay 4.000 [get_ports SDLINKF]
set_output_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports STATA_OUT]
set_output_delay -clock [get_clocks CLK125F_P] -max -add_delay 4.000 [get_ports STATA_OUT]
set_output_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports TOKENFO]
set_output_delay -clock [get_clocks CLK125F_P] -max -add_delay 4.000 [get_ports TOKENFO]
set_output_delay -clock [get_clocks CLK125F_P] -min -add_delay 0.000 [get_ports TRIGFO]
set_output_delay -clock [get_clocks CLK125F_P] -max -add_delay 4.000 [get_ports TRIGFO]
